Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ འཇིག་རྟེན་ བཟང་པོ་ སྤོས་ འཚོང་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷ་ཆེན་ དེ་ ལ་ ཕྱེ་མ་ ཡིས །_། བཀང་བ འི་ ན་བཟའ་ དང་ ནི་ པད་མ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $363 “The well-gone Lokasundara, when the son of an incense merchant, |#| Offered garments filled with fragrant powder along with lotus flowers |#| To the thus-gone Great Deity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མྱ་ངན་མེད་པ་ གོས་ འཚོང་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་ ནི་ ཟབ་མོ་ དེ་ ལ་ ཡང་ །_། རྫི་ཆར་ བྱུང་བ འི་ ཚེ་ ན་ མེ་ཏོག་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $364 “The well-gone Aśoka, when the son of a clothing merchant, |#| Offered a flower umbrella during a rainstorm |#| To the thus-gone Profound Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཤུགས་ བཅུ་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ ཅན །_། ལམ་ དུ་ ཞུགས་ ཚེ་ གདན་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $365 “The thus-gone Daśavaśa, when a prince, |#| Offered sitting mats |#| To the thus-gone Lord of Dharma when he was traveling |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟོབས་ དགྱེས་ རོལ་མོ་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཙོ་ ཆེན་ དེ་ ལ་ ནི །_། དུང་ སྒྲ་ དག་ ནི་ བུད་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $366 “The well-gone Balanandin, when a musician, |#| Offered conch tones |#| To the thus-gone Great Leader |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐུ་དཔལ་ རོལ་མོ འི་ གླུ་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ སེམས་ དེ་ལས །_། གསུམ་ ལ་ སྐྱབས་ སུ་ འགྲོ་བ་ མནོས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $367 “The well-gone Sthāmaśrī, when a singer, |#| Received the refuge vows |#| From the thus-gone Intelligent Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མཐུ་ཐོབ་ མཉན་པ འི་ ཚེ །_། ཆུ་བོ་ དག་ ལ་ ཟམ་པ་ བཙུགས་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འོད་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $368 “The thus-gone Sthāmaprāpta, when a ferryman, |#| Constructed a bridge across a river |#| Before the thus-gone Light of Wisdom |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མཐུ་ཆེན་ ཁྲུས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དགོངས་པ་ འཁྲུལ་ མེད་ ལ །_། ཁྲུས་རས་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $369 “The thus-gone Mahāsthāman, when a bath attendant, |#| Offered towels |#| To the thus-gone Wisdom without Delusion |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ སྙིང་པོ་ ཚོང་ [306a] དཔོན་ གྱི །_། བུ་ ཚེ་ བདེ་གཤེགས་ བསོད་ནམས་ འཕགས་པ་ ལ །_། དྷ་ ནུ་ སྐ་ ར འི་ མེ་ཏོག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $370 “The well-gone Guṇagarbha, when the son of a merchant, [306.a] |#| Offered dhānuṣkārin flowers |#| To the well-gone Superior Merit |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བདེན་ སྤྱོད་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ནོར་ལྷ འི་ བུ་ གྲགས་ ལ །_། སྤོས་ ཀྱི་ རི་ལུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $371 “The thus-gone Satyacara, when an incense merchant, |#| Offered balls of incense |#| To the thus-gone Renowned Son of the God of Wealth |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དགེ་ མཆོག་ རྒྱལ་པོ་ རྒྱལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་ ཆེན་ སངས་རྒྱས་ དེ་ ལ་སོགས །_། དགེ་སློང་ དག་ གི་ དགེ་འདུན་ སྤྱན་ ནི་ དྲངས་ ནས་ ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $372 “The thus-gone Kṣemottamarāja, when a king, |#| Invited the thus-gone Buddha of Great Array |#| Along with his saṅgha of monks, |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྐར་རྒྱལ་ ཤིང་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ འོད་ལྡན་པ །_། བདེ་གཤེགས་ དེ་ ལ་ ཐལ་སྦྱར་ ཕྱག་ བྱས་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $373 “The thus-gone Tiṣya, when a carpenter, |#| Joined his palms in homage |#| Before the blessed one, the thus-gone Endowed with Moonlight, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ཟེར་ ཆེན་པོ་ ཚལ་ གྱི་ ལས །_། བྱེད་ ཚེ་ བདེ་གཤེགས་ ལྷ་ ཡི་ འོད་ཟེར་ ལ །_། ལྗོན་པ འི་ ཚོན་ དག་ སྦྱར་ ཏེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $374 “The well-gone Mahāraśmi, when a gardener, |#| Prepared and offered dyes made from trees |#| Before the well-gone Divine Radiance |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གློག་འོད་ རྫ་མཁན་ ཚེ །_། བདེ་གཤེགས་ འོད་གསལ་ དེ་ ལ་ ཟླ་བ་ བཞི ར །_། བུམ་པ་ ཆུ་ ཡིས་ བཀང་ སྟེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $375 “The thus-gone Vidyutprabha, when a potter, |#| Offered jars filled with water for four months |#| To the well-gone Luminous |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ རྒྱ་ ཆེན་ ནད་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ དགྱེས་ དེ་ ལ །_། ལྕགས་ ཀྱི་ སྣོད་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $376 “The well-gone Guṇavisṛta, when a sick person, |#| Offered iron vessels |#| To the thus-gone Delighting in Merit |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་པོ་ཆེ་ ནི་ ཚོང་དཔོན་ གྱི །_། བུ་ ཚེ་ བདེ་གཤེགས་ སེང་གེ འི་ བློ་གྲོས་ ལ །_། མུ་ཏིག་ དག་ གི་ ཆུན་ ཕྲེང་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $377 “The well-gone Ratna, when the son of a merchant, |#| Offered a pearl garland |#| To the well-gone Lion Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དཔལ་ འོད་ སྤོས་ འཚོང་ གི །_། བུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ ས་ གཙོ་ ལ །_། ཕྱེ་མ ས་ བཀང་བ འི་ ཨུད་ པལ་ ན་བཟའ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $378 “The thus-gone Śrīprabha, when the son of an incense merchant, |#| Offered utpalas and garments suffused with fragrant powder |#| To the thus-gone Foremost on This Earth |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གོ་ཆ་ བགོས་པ་ ལྷ འི་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ འོད་ དེ་ ལ །_། བསྟོད་པ་ དག་ གིས་ བསྟོད་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $379 “The well-gone Kṛtavarman,#192 when a divine son, |#| Offered praises |#| To the thus-gone Jewel Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ ཕྱག་ ནི་ ཚལ་ གྱི་ ལས །_། བྱེད་ ཚེ་ བདེ་གཤེགས་ འོད་ཟེར་ བཟང་པོ་ ལ །_། མེ་ཏོག་ དག་ གི་ ཕུར་མ་ ཕུལ་ [306b] ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $380 “The well-gone Siṃhahasta, when a garden worker, |#| Offered vessels of flowers |#| To the well-gone Excellent Radiance[306.b] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ བཟང་པོ་ ཡིག་མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྣ་ཚོགས་ གསུང་ དེ་ ལ །_། གྲོ་བ འི་ གླེགས་མ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $381 “The well-gone Supuṣpa, when a scribe, |#| Offered birch bark scrolls |#| To the thus-gone Diverse Teaching |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ མཐོན་པོ་ ཤལ་ ཁྱེར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ སྡུག་ དེ་ ལ །_། མར་མེ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $382 “The well-gone Ratnottama, when a porter carrying plaster, |#| Offered butter lamps |#| To the thus-gone Lovely Moon |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱ་མཚོ་ རོལ་མོ་ མཁན་ གྱི་ ཚེ །_། རྔ་བོ་ ཆེ་ དག་ བརྡུང་བ་ བྱས་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ གདུགས་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $383 “The well-gone Sāgara, when a musician, |#| Beat great drums |#| Before the thus-gone Moon Parasol |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ས་འཛིན་ མགར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གཟིགས་ དེ་ ལ །_། མཚོན་ཆ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $384 “The thus-gone Dharaṇīdhara, when a blacksmith, |#| Offered weapons |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ བློ་ ལྷ འི་ བུ་ ཉི་མ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གོས་པ་ མེད་ དེ་ ལ །_། མེ་ཏོག་ མན་ད་ར་བ་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $385 “The well-gone Arthabuddhi, when a divine son by the name of Sun, |#| Scattered mandārava flowers |#| Before the thus-gone Immaculate |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ བསགས་པ་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་ བླ་ བཞུད་པ་ ན །_། |#| འདམ་རྫབ་ དག་ ཏུ་ རྡོ་ལེབ་ ཟམ་ བཙུགས་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $386 “The well-gone Guṇagaṇa, when a physician, |#| Built a bridge of flat stones across a swamp |#| Before the thus-gone Movement of Highest Renown |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ ཚོགས་ ནི་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཞལ་ དེ་ ལ །_། སྐྱུ་རུ་ར་ ཡི་ འབྲས་བུ་ གཅིག་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $387 “The well-gone Guṇagaṇa, when a physician, |#| Offered a myrobalan fruit |#| To the thus-gone Moon Face |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ མེ་ ནི་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀླུ་ ཡི་ ལྷ་ དེ་ ལ །_། བཻ་ དཱུརྱའི་ སྣོད་ ཆུ་ ཡིས་ བཀང་ སྟེ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $388 “The well-gone Ratnāgni, when a captain, |#| Offered a beryl vessel filled with water |#| To the thus-gone God of Nāgas |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འཇིག་རྟེན་ འདས་པ་ ཚོང་འདུས་པ །_། བྱེད་ ཚེ་ དགེ་འདུན་ དག་ ལ་ འོད་ སྒྲོན་ ཕུལ །_། |#| དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཕུང་པོ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $389 “The well-gone Lokāntara, when a market merchant, |#| Offered shining lamps to the saṅgha |#| Before the thus-gone Heap of Qualities, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འཇིག་རྟེན་ ཟླ་བ་ འཁོར་ སྒྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ བློ་ དེ་ ལ །_། གཙུག་ལག་ཁང་ ནི་ སྟོང་ སྙེད་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $390 “The well-gone Lokacandra, when a universal monarch, |#| Offered one thousand monastic temples |#| To the thus-gone Mind of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དབྱངས་སྙན་ རྒྱལ་པོ་ བྲམ་ཟེ འི་ ཚེ །_། ཕྱོགས་ [307a] བཞི འི་ དགེ་འདུན་ དག་ གི་ བསམ་གཏན་ ཁང་ བརྩིགས་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ མཆོག་མ་ དེ་ ལ་ ནི །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $391 “The thus-gone Madhura­svara­rāja, when a brahmin, [307.a] |#| Built meditation cabins for the members of the saṅgha in the four directions |#| Before the thus-gone Supreme Flower, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚངས་ ཏོག་ བྲམ་ཟེ འི་ བུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འཇིག་རྟེན་ དགའ་ དེ་ |#| ལ །_། ཀུ་ཤ འི་ ན་བཟའ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $392 “The well-gone Brahmaketu, when the son of a brahmin, |#| Offered clothing made of kuśa grass |#| To the thus-gone Joy for the World |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚོགས་ཅན་ གཙོ་བོ་ བྲམ་ཟེ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ དཔག་མེད་ ལ །_། རིལ་བ་ ཆུ་ ཡིས་ བཀང་ སྟེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $393 “The well-gone Gaṇimukha, when a brahmin, |#| Offered a pot filled with water |#| To the thus-gone Immeasurable Splendor |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་ སྟབས་ གླིང་ གཅིག་ རྒྱལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདེན་པ འི་ ཏོག་ དེ་ ལ །_། རས་ བཅོས་ གདིང་བ་ དཔག་ཚད་ གཅིག་པ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $394 “The well-gone Siṃhagati, when the king of one continent, |#| Offered fine cotton and carpets one league large |#| To the thus-gone Truth Crest |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དྲག་ཤུལ་ བྱིན་ ནི་ ཚོང་དཔོན་ གྱི །_། ཆུང་མ འི་ ཚེ་ ན་ བདེ་གཤེགས་ ཉི་འོད་ ལ །_། ཕྱེ་མ་ སྤར་གང་ དག་ གིས་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $395 “The well-gone Ugradatta, when the wife of a merchant, |#| Sprinkled handfuls of fragrant powder |#| Before the well-gone Sunlight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ འོད་ དེ་ ལ །_། མེ་ཏོག་ ཆལ་ པར་ བཀྲམ་པ་ ཀུན་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $396 “The well-gone Dharmeśvara, when a garland maker, |#| Spread out a blanket of flowers as an offering |#| Before the thus-gone Nectar Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་བརྗིད་ འོད་ ནི་ ལྷ འི་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟོན་པ ར་ དགྱེས་པ་པོ །_། བྱང་ཆུབ་ སྙིང་པོ ར་ བཞུགས་ ལ་ རྩྭ་གདན་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $397 “The well-gone Tejasprabha, when a divine son, |#| Offered a straw mat |#| To the thus-gone Delighting in Teaching, who was residing upon his seat of awakening, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ཟེར་ ཆེན་པོ་ ཁྱིམ་བདག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསང་བ ར་ དགྱེས་ དེ་ ལ །_། རས་ བཅོས་ བྱེ་བ་ སྙེད་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $398 “The well-gone Mahāraśmi, when a householder, |#| Offered tens of millions of fine fabrics |#| To the thus-gone Secret Delight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ གྲགས་པ་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱིག་ གི་ འོད་ཟེར་ ལ །_། བླ་རེ་ སྤོས་ ཅན་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $399 “The well-gone Ratnayaśas, when a prince, |#| Offered fragrant canopies |#| To the thus-gone Radiant Treasure |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚོགས་ཅན་ གསལ་བ་ རིན་ཆེན་ འཚོང་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ འབྱུང་གནས་ དེ་ ལ་ ནི །_། རིན་པོ་ཆེ་ དག་ སྤར་བ་ བཀང་ སྟེ་ |#| གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $400 “The well-gone Gaṇiprabhāsa, when a jewel merchant, |#| Scattered a handful of jewels |#| Before the thus-gone Source of Merit |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་པ་ མཐའ་ ཡ ས་ [307b] དེད་དཔོན་ གྱི །_། བུ་ ཚེ་ བདེ་གཤེགས་ མེ་ཏོག་ དཔལ་ དེ་ ལ །_། ན་བཟའ་ བླ་རེ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $401 “The well-gone Anantayaśas, when the son of a captain, [307.b] |#| Offered clothing and canopies |#| To the well-gone Flower Glory |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ཟེར་ དོན་ཡོད་ རྒྱ་མཚོ འི་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཕྱག་ ལྡན་ དེ་ |#| ལ་ ནི །_། མུ་ཏིག་ དམར་པོ་ སྤར་བ་ བཀང་ སྟེ་ |#| གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $402 “The well-gone Amogharaśmi, when a seafaring merchant, |#| Scattered a handful of red pearls |#| Before the thus-gone Hands of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལྷ་ ཡི་ དྲང་སྲོང་ དྲང་སྲོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ སྒྲོན་མ་ ལ །_། ལོ་མ་ དག་ གི་ གདུགས་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $403 “The well-gone Ṛṣideva, when a sage, |#| Offered a parasol made of leaves |#| To the thus-gone Dharma Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐྱེ་ དབང་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ཏུ་འོད་ ཟེར་ ལ །_། གླིང་བཞི་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $404 “The well-gone Janendra, when a universal monarch, |#| Offered the four continents |#| To the thus-gone Universal Radiance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དགེ་འདུན་ བརྟན་པ་ མཐའ་འཁོབ་ རྒྱལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཚངས་པ འི་ དབྱངས་ཅན་ དེ་ ལ་ ནི །_། མེ་ཏོག་ སྟོང་ སྙེད་ བཀྲམ་པ འི་ འཆག་ས་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $405 “The well-gone Dṛḍhasaṅgha, when the king of a barbarian realm, |#| Offered a monastic walkway covered with thousands of flowers |#| To the thus-gone Possessor of the Brahmā Melody |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ བཟང་ གསེར་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ་ ཆེན་པོ་ ལ །_། གསེར་ གྱི་ གླེགས་མ་ བཀྲམ་པ འི་ འཆག་ས་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $406 “The thus-gone Supakṣa, when a gold merchant, |#| Offered a monastic walkway covered with gold |#| To the thus-gone Great Array |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཏོག་ ནི་ གསེར་མགར་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཐར་པ འི་ ཉི་མ་ ལ །_། མར་མེ་ བཟང་པོ་ བཤམས་ ཏེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $407 “The well-gone Ketu, when a young goldsmith, |#| Prepared fine butter lamps as an offering |#| Before the thus-gone Sun of Liberation |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡུལ་འཁོར་ མེ་ཏོག་ རྩྭ་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ བརྟན་པོ་ ཡི །_། འཆག་ས་ རྩྭ་ ཡིས་ ཁེབས་པ ར་ བཀྲམ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $408 “The well-gone Kusumarāṣṭra, when a straw seller, |#| Covered a monastic walkway with straw |#| Before the thus-gone Steadfast Diligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆོས་ ཀྱི་ བླ་ གྲོས་ ཚོང་དུས་པ་ ཡི་ ཚེ །_། ཚོང་དུས་ བར་སྲང་ དག་ ནི་ ཕྱག་དར་ བྱས་ ནས་ |#| ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་ ཡི་ འོད་ལྡན་ དེ་ |#| ལ་ ནི །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $409 “The well-gone Dharmamati, when a market salesman, |#| Swept the lanes of the market |#| Before the thus-gone Possessing the Light of Intelligence, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རླུང་ ཤུགས་ ལྟར་ གཤེགས་ དྷིང་ ཏ་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ གྲགས་པ་ དེ་ ལ་ ནི །_། བསིལ་ཡབ་ དག་ གིས་ གཡབ་པ་ དག་ ནི་ བྱས་ ནས་ |#| ཀྱང་ །_། [308a] དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $410 “The well-gone Anilavegagāmin, when a young dhing ta,#193 |#| Offered cooling fanning |#| To the thus-gone Famed Qualities[308.a] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལེགས་ བསམས་ གྲགས་པ་ གཏ ར་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ འི་ བློ་ དེ་ ལ །_། ནོར་བུ་ སྐར་འོད་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $411 “The well-gone Sucittayaśas, when a surgeon#194 |#| Offered a starlight jewel |#| To the thus-gone Excellent Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྣང་ ལྡན་ རྒྱལ་པོ འི་ ཕོ་ཉ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ་ དཔག་མེད་ ལ །_། ལན་ གསུམ་ བསྐོར་བ་ དག་ ནི་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $412 “The well-gone Dyutimat, when a royal messenger, |#| Three times circumambulated |#| The thus-gone Immeasurable Array |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལྷ་ཚོགས་ འཁོར་ སྒྱུར་ བློན་ མཆོག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ མཆེ་བ་ ལ །_། གསེར་ དང་ བྱི་རུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $413 “The well-gone Marutskandha, when a universal monarch’s chief minister, |#| Offered gold and coral |#| To the thus-gone Lion Fangs |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ བསྲུངས་པ་ འདྲོན་པོ འི་ ཚེ །_། ལམ་སྲང་ དག་ ཏུ་ རྡོ་སྟེགས་ བཙུགས་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ མཐུ་རྩལ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $414 “The well-gone Guṇagupta, when a traveler, |#| Paved the roads with tiles |#| Before the thus-gone Powerful Merit, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ གྱི་ བློ་གྲོས་ ལྔ་ མངོན་ཤེས་པ་ པོ །_། བྲམ་ཟེ འི་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷ་ མཆོག་ གི །_། ཞབས་ ལ་མགོ་བོ་ དག་ གི་ ཕྱག་ དག་ འཚལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $415 “The well-gone Arthamati, when a brahmin who possessed the five superknowledges, |#| Bowed his head to the feet |#| Of the thus-gone Supreme Deity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསྙེངས་ མེད་ ཆུ་རྐ་ སྲུང་བ འི་ ཚེ །_། ཉིན་ཞག་ བདུན་ དུ་ བྱམས་པ་ བསྒོམས་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ གཟིགས་ གནས་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $416 “The well-gone Abhaya, when the guard of an irrigation channel, |#| Cultivated love for seven days |#| Before the thus-gone Abiding by Seeing, |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གྲོགས་ བརྟན་ གོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷ་ ཡི་ མཆོད་རྟེན་ ལ །_། ཁང་ བརྩེགས་ མོན་དར་ དག་ གིས་ བཀབ་པ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $417 “The thus-gone Sthitamitra, when a clothing merchant, |#| Offered multistoried mansions enveloped in kauśeya silk |#| To the thus-gone Divine Stūpa |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ གནས་ མཚུངས་པ་ དགེ་སློང་ ཚེ །_། དམ་ཆོས་ ཡོངས་སུ་ གཟུང་ ཕྱིར་ སྤྲོ་ བསྐྱེད་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ གློག་ གི་ འོད་ཟེར་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $418 “The well-gone Prabhāsthita­kalpa, when a monk, |#| Developed enthusiasm for protecting the sacred Dharma |#| Before the thus-gone Flashing Radiance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ནོར་ ཞབས་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་བ ར་ དགྱེས་ དེ་ ལ །_། མེ་ཏོག་ ཨུད་ པལ་ ཆང་པ་ གང་ གཏོར་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $419 “The well-gone Maṇicaraṇa, when the son of a merchant, |#| Scattered a rain of utpala flowers |#| Before the thus-gone Delighting in Victory |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཐར་པ འི་ གཟི་བརྗིད་ གྲོང་དཔོན་ བུ་མོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ རྒྱལ་མཚན་ [308b] དེ་ ལ་ ནི །_། བསོད་སྙོམས་ དང་པོ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $420 “The well-gone Mokṣatejas, when the daughter of the head of a city, |#| Offered the first alms |#| To the thus-gone Majestic Banner [308.b] |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ངོས་ བཟངས་ ཕྱུགས་རྫི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ འོད་ དེ་ ལ །_། ཞུན་མ ར་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $421 “The thus-gone Sundarapārśva, when a cattle herder, |#| Offered refined butter |#| To the thus-gone Flower Light |#| And in doing so first gave rise to the mind of awakening.
